src/main/resources/test.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
    <GetCurrencyRates xmlns="http://tempuri.org/">
        <RateDate>2020-02-02</RateDate>
    </GetCurrencyRates>
</soap:Body>
</soap:Envelope>
